app/controllers/comments_controller.rb

  def create
    @link = Link.find(params[:link_id])
    @comment = @link.comments.new(comment_params)
    @comment.user = current_user

    respond_to do |format|
      if @comment.save
---
SELECT  "links".* FROM "links" WHERE "links"."id" = ? LIMIT 1  [["id", 7]]
INSERT INTO "comments" ("body", "link_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "trying html tag <h2>hello</h2>"], ["link_id", 7], ["user_id", 1], ["created_at", "2015-05-30 13:36:14.997226"], ["updated_at", "2015-05-30 13:36:14.997226"]]