app/controllers/links_controller.rb

SELECT "links".* FROM "links"
---
  def index
    @links = Link.all

SELECT  "links".* FROM "links" WHERE "links"."id" = ? LIMIT 1  [["id", 7]]
---
  def upvote
    @link = Link.find(params[:id])

SELECT  "links".* FROM "links" WHERE "links"."id" = ? LIMIT 1  [["id", 8]]
---
  def downvote
    @link = Link.find(params[:id])

INSERT INTO "links" ("title", "url", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "reddit"], ["url", "www.reddit.com"], ["user_id", 2], ["created_at", "2015-05-29 23:51:48.263827"], ["updated_at", "2015-05-29 23:51:48.263827"]]
---
  def create
    @link = current_user.links.build(link_params)

    respond_to do |format|
      if @link.save

UPDATE "links" SET "url" = ?, "updated_at" = ? WHERE "links"."id" = ?  [["url", "www.fb.com"], ["updated_at", "2015-05-30 17:10:16.575891"], ["id", 15]]
---
  def update
    respond_to do |format|
      if @link.update(link_params)

DELETE FROM "links" WHERE "links"."id" = ?  [["id", 1]]
---
  def destroy
    @link.destroy

SELECT  "links".* FROM "links" WHERE "links"."id" = ? LIMIT 1  [["id", 15]]
---
    def set_link
      @link = Link.find(params[:id])